[
  {
    "title": "Arquitetura Limpa",
    "slug": "arquitetura-limpa",
    "date": "2026-02-28",
    "summary": "Como estruturar projetos de software escaláveis usando os princípios de Clean Architecture.",
    "tags": [
      "software",
      "architecture"
    ],
    "featured": true,
    "content": "<h2>O que é Arquitetura Limpa?</h2>\n<p>Arquitetura Limpa é um conjunto de princípios que visa separar as responsabilidades do software em camadas bem definidas. O objetivo principal é criar sistemas que sejam independentes de frameworks, testáveis, independentes de UI e de banco de dados.</p>\n<h2>As camadas principais</h2>\n<p>A arquitetura é organizada em círculos concêntricos:</p>\n<ul><li><strong>Entidades</strong>: Regras de negócio centrais</li>\n<li><strong>Casos de Uso</strong>: Lógica de aplicação</li>\n<li><strong>Adaptadores de Interface</strong>: Controllers, Presenters, Gateways</li>\n<li><strong>Frameworks e Drivers</strong>: UI, banco de dados, ferramentas externas</li>\n</ul>\n<h2>Por que usar?</h2>\n<p>Sistemas construídos com Arquitetura Limpa são mais fáceis de manter, testar e evoluir ao longo do tempo. A separação clara de responsabilidades torna o código mais legível e os times mais produtivos.</p>"
  },
  {
    "title": "Mentalidade de Desenvolvedor",
    "slug": "mentalidade-dev",
    "date": "2026-02-20",
    "summary": "Reflexões sobre como pensar como um desenvolvedor de software profissional.",
    "tags": [
      "carreira",
      "mindset"
    ],
    "featured": false,
    "content": "<h2>Pensamento sistêmico</h2>\n<p>Um bom desenvolvedor não apenas escreve código, ele resolve problemas. Isso requer uma mudança de mentalidade: antes de codar, entenda o problema profundamente.</p>\n<h2>Aprendizado contínuo</h2>\n<p>A área de tecnologia evolui rapidamente. Desenvolvedores que prosperam são os que cultivam o hábito de aprender constantemente, seja através de livros, projetos pessoais ou contribuições open source.</p>\n<h2>Comunicação é fundamental</h2>\n<p>Código é lido por humanos. Escrever código claro e bem documentado é uma forma de respeito com seus colegas e com o seu \"eu futuro\".</p>"
  },
  {
    "title": "Aprendendo Hugo",
    "slug": "aprendendo-hugo",
    "date": "2026-02-10",
    "summary": "Um guia prático para começar a usar o Hugo como gerador de sites estáticos.",
    "tags": [
      "hugo",
      "jamstack",
      "web"
    ],
    "featured": false,
    "content": "<h2>O que é Hugo?</h2>\n<p>Hugo é um gerador de sites estáticos escrito em Go, conhecido por sua velocidade impressionante. É ideal para blogs, portfólios e documentação.</p>\n<h2>Por que Hugo?</h2>\n<ul><li><strong>Velocidade</strong>: Gera milhares de páginas em segundos</li>\n<li><strong>Simplicidade</strong>: Conteúdo em Markdown, sem banco de dados</li>\n<li><strong>Flexibilidade</strong>: Temas customizáveis e sistema de templates poderoso</li>\n</ul>\n<h2>Primeiros passos</h2>\n<pre><code class=\"language-bash\"># Instalar Hugo\nbrew install hugo\n<h1>Criar novo site</h1>\nhugo new site meu-blog\n<h1>Adicionar um tema</h1>\ncd meu-blog\ngit init\ngit submodule add https://github.com/theNewDynamic/gohugo-theme-ananke themes/ananke\n<h1>Rodar localmente</h1>\nhugo server -D</code></pre>\n<h2>Estrutura de arquivos</h2>\n<p>O Hugo espera que os posts estejam em <code>content/posts/</code> no formato Markdown com front matter YAML.</p>"
  }
]